import pyautogui
from time import sleep

import pyperclip

# 鼠标位置信息
mousePos = [(0, 0), (0, 0), (0, 0), (0, 0)]

# 替换列表，(需要替换的，替换后的)，来源https://www.unicode.org/charts/nameslist/n_2F00.html
transList = [
    ('⼀', '一'),
    ('⼁', '丨'),
    ('⼂', '丶'),
    # ('⼃', '丿'),
    ('⼄', '乙'),
    # ('⼅', '亅'),
    ('⼆', '二'),
    # ('⼇', '亠'),
    ('⼈', '人'),
    ('⼉', '儿'),
    ('⼊', '入'),
    ('⼋', '八'),
    # ('⼌', '冂'),
    # ('⼍', '冖'),
    # ('⼎', '冫'),
    ('⼏', '几'),
    # ('⼐', '凵'),
    ('⼑', '刀'),
    ('⼒', '力'),
    # ('⼓', '勹'),
    ('⼔', '匕'),
    ('⼕', '匚'),
    ('⼖', '匸'),
    ('⼗', '十'),
    ('⼘', '卜'),
    # ('⼙', '卩'),
    ('⼚', '厂'),
    # ('⼛', '厶'),
    ('⼜', '又'),
    ('⼝', '口'),
    ('⼞', '囗'),
    ('⼟', '土'),
    ('⼠', '士'),
    # ('⼡', '夂'),
    # ('⼢', '夊'),
    ('⼣', '夕'),
    ('⼤', '大'),
    ('⼥', '女'),
    ('⼦', '子'),
    # ('⼧', '宀'),
    ('⼨', '寸'),
    ('⼩', '小'),
    # ('⼪', '尢'),
    ('⼫', '尸'),
    ('⼬', '屮'),
    ('⼭', '山'),
    # ('⼮', '巛'),
    ('⼯', '工'),
    ('⼰', '己'),
    ('⼱', '巾'),
    ('⼲', '干'),
    ('⼳', '幺'),
    ('⼴', '广'),
    # ('⼵', '廴'),
    # ('⼶', '廾'),
    ('⼷', '弋'),
    ('⼸', '弓'),
    # ('⼹', '彐'),
    # ('⼺', '彡'),
    # ('⼻', '彳'),
    ('⼼', '心'),
    ('⼽', '戈'),
    ('⼾', '戶'),
    ('⼿', '手'),
    ('⽀', '支'),
    ('⽁', '攴'),
    ('⽂', '文'),
    ('⽃', '斗'),
    ('⽄', '斤'),
    ('⽅', '方'),
    ('⽆', '无'),
    ('⽇', '日'),
    ('⽈', '曰'),
    ('⽉', '月'),
    ('⽊', '木'),
    ('⽋', '欠'),
    ('⽌', '止'),
    ('⽍', '歹'),
    ('⽎', '殳'),
    ('⽏', '毋'),
    ('⽐', '比'),
    ('⽑', '毛'),
    ('⽒', '氏'),
    ('⽓', '气'),
    ('⽔', '水'),
    ('⽕', '火'),
    ('⽖', '爪'),
    ('⽗', '父'),
    ('⽘', '爻'),
    ('⽙', '爿'),
    ('⽚', '片'),
    ('⽛', '牙'),
    ('⽜', '牛'),
    ('⽝', '犬'),
    ('⽞', '玄'),
    ('⽟', '玉'),
    ('⽠', '瓜'),
    ('⽡', '瓦'),
    ('⽢', '甘'),
    ('⽣', '生'),
    ('⽤', '用'),
    ('⽥', '田'),
    ('⽦', '疋'),
    ('⽧', '疒'),
    ('⽨', '癶'),
    ('⽩', '白'),
    ('⽪', '皮'),
    ('⽫', '皿'),
    ('⽬', '目'),
    ('⽭', '矛'),
    ('⽮', '矢'),
    ('⽯', '石'),
    ('⽰', '示'),
    # ('⽱', '禸'),
    ('⽲', '禾'),
    ('⽳', '穴'),
    ('⽴', '立'),
    ('⽵', '竹'),
    ('⽶', '米'),
    # ('⽷', '糸'),
    ('⽸', '缶'),
    ('⽹', '网'),
    ('⽺', '羊'),
    ('⽻', '羽'),
    ('⽼', '老'),
    ('⽽', '而'),
    ('⽾', '耒'),
    ('⽿', '耳'),
    ('⾀', '聿'),
    ('⾁', '肉'),
    ('⾂', '臣'),
    ('⾃', '自'),
    ('⾄', '至'),
    ('⾅', '臼'),
    ('⾆', '舌'),
    ('⾇', '舛'),
    ('⾈', '舟'),
    ('⾉', '艮'),
    ('⾊', '色'),
    ('⾋', '艸'),
    # ('⾌', '虍'),
    ('⾍', '虫'),
    ('⾎', '血'),
    ('⾏', '行'),
    ('⾐', '衣'),
    # ('⾑', '襾'),
    # ('⾒', '見'),
    ('⾓', '角'),
    ('⾔', '言'),
    ('⾕', '谷'),
    ('⾖', '豆'),
    ('⾗', '豕'),
    ('⾘', '豸'),
    ('⾙', '貝'),
    ('⾚', '赤'),
    ('⾛', '走'),
    ('⾜', '足'),
    ('⾝', '身'),
    ('⾞', '車'),
    ('⾟', '辛'),
    ('⾠', '辰'),
    # ('⾡', '辵'),
    ('⾢', '邑'),
    ('⾣', '酉'),
    ('⾤', '釆'),
    ('⾥', '里'),
    ('⾦', '金'),
    ('⾧', '長'),
    # ('⾨', '門'),
    ('⾩', '阜'),
    ('⾪', '隶'),
    ('⾫', '隹'),
    ('⾬', '雨'),
    # ('⾭', '靑'),
    ('⾮', '非'),
    ('⾯', '面'),
    ('⾰', '革'),
    # ('⾱', '韋'),
    ('⾲', '韭'),
    ('⾳', '音'),
    # ('⾴', '頁'),
    # ('⾵', '風'),
    # ('⾶', '飛'),
    ('⾷', '食'),
    ('⾸', '首'),
    ('⾹', '香'),
    # ('⾺', '馬'),
    ('⾻', '骨'),
    ('⾼', '高'),
    # ('⾽', '髟'),
    # ('⾾', '鬥'),
    # ('⾿', '鬯'),
    # ('⿀', '鬲'),
    ('⿁', '鬼'),
    # ('⿂', '魚'),
    # ('⿃', '鳥'),
    # ('⿄', '鹵'),
    ('⿅', '鹿'),
    # ('⿆', '麥'),
    ('⿇', '麻'),
    ('⿈', '黃'),
    ('⿉', '黍'),
    ('⿊', '黑'),
    # ('⿋', '黹'),
    # ('⿌', '黽'),
    ('⿍', '鼎'),
    ('⿎', '鼓'),
    ('⿏', '鼠'),
    ('⿐', '鼻'),
    # ('⿑', '齊'),
    # ('⿒', '齒'),
    # ('⿓', '龍'),
    # ('⿔', '龜'),
    ('⿕', '龠')
]


def showMousePos():  # 演示鼠标位置
    text = ['鼠标移动到【‘查找’输入框】处，按回车继续',
            '鼠标移动到【‘替换为’输入框】处，按回车继续',
            '鼠标移动到【‘全部替换’按钮】处，按回车继续',
            '鼠标移动到【替换完成‘确定’按钮】处（无此步骤则位置应为点击后无不良影响的位置），按回车继续']
    for i in range(len(text)):
        pyautogui.moveTo(mousePos[i][0], mousePos[i][1])
        input(text[i])


def learnMousePos():  # 录入鼠标位置
    text = ['请将鼠标移动到【‘查找’输入框】处，按回车录入',
            '请将鼠标移动到【‘替换为’输入框】处，按回车录入',
            '请将鼠标移动到【‘全部替换’按钮】处，按回车录入',
            '请将鼠标移动到【替换完成‘确定’按钮】处（无此步骤的话请将鼠标移动到点击后无不良影响的位置），按回车录入']
    for i in range(len(text)):
        input(text[i])
        x, y = pyautogui.position()
        mousePos[i] = (x, y)
        print('录入鼠标位置', mousePos[i])
    print('鼠标轨迹录制完成，如需要请替换代码内鼠标位置信息变量。mousePos =', mousePos)
    sleep(1)


def trans():  # 开始转换
    # afterMoveSleep = 0.1  # 鼠标移动后延时
    afterClickSleep = 0.02  # 鼠标点击后延时
    afterPressSleep = 0.02  # 键盘按键后延时
    # afterWriteSleep = 0.1  # 键盘输入文字后延时
    afterTransSleep = 0.1  # 点击替换后延时
    count = 0
    for item in transList:
        count += 1
        print(f'{count}/{len(transList)} {item[0]}->{item[1]}')

        # 查找
        pyperclip.copy(item[0])
        pyautogui.click(mousePos[0][0], mousePos[0][1])
        sleep(afterClickSleep)
        pyautogui.hotkey('ctrl', 'a')
        sleep(afterPressSleep)
        pyautogui.hotkey('ctrl', 'v')
        sleep(afterPressSleep)

        # 替换为
        pyperclip.copy(item[1])
        pyautogui.click(mousePos[1][0], mousePos[1][1])
        sleep(afterClickSleep)
        pyautogui.hotkey('ctrl', 'a')
        sleep(afterPressSleep)
        pyautogui.hotkey('ctrl', 'v')
        sleep(afterPressSleep)

        # 全部替换
        pyautogui.click(mousePos[2][0], mousePos[2][1])
        sleep(afterTransSleep)

        # 弹出替换完成，点击确定
        pyautogui.click(mousePos[3][0], mousePos[3][1])
        sleep(afterClickSleep)


if __name__ == '__main__':
    while 1:
        print('当前mousePos信息：', mousePos)
        opt = input('请选择功能：\n'
                    '1.录入鼠标位置\n'
                    '2.演示鼠标位置\n'
                    '3.开始替换文字\n'
                    '0.退出\n'
                    '输入编号:')
        if opt == '1':
            learnMousePos()
        elif opt == '2':
            showMousePos()
        elif opt == '3':
            trans()
        elif opt == '0':
            exit(0)
